app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("answer", "created_at", "data", "id", "img_url", "title", "updated_at", "user_answer") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "data" = 'Какую работу надо совершить, чтобы выдуть мыльный пузырь диаметром d? Поверхностное натяжение раствора равно sigma.', "img_url" = 'http://cs9532.userapi.com/g14710175/a_672bc67f.jpg', "updated_at" = '2014-02-21 17:55:24.028002' WHERE "tasks"."id" = 2